examples/wingTemplate/constant/surfConv
#!/bin/bash

surfaceConvert \Input/*ing*.stl \triSurface/wing.stl -clean -scale 0.0254


exit;


